Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxRif_regdef.h
/** \brief Debug Delay Register 1 */
typedef struct _Ifx_RIF_DBGDLY1_Bits
{
    Ifx_UReg_32Bit FDLY2:3;           /**< \brief [2:0] Frame Signal Delay Line RX2 - FDLY2 (rh) */
    Ifx_UReg_32Bit reserved_3:1;      /**< \brief [3:3] \internal Reserved */
    Ifx_UReg_32Bit CDLY2:3;           /**< \brief [6:4] Clock Signal Delay Line RX2 - CDLY2 (rh) */
    Ifx_UReg_32Bit reserved_7:1;      /**< \brief [7:7] \internal Reserved */
    Ifx_UReg_32Bit DDLY2:3;           /**< \brief [10:8] Data Signal Delay Line RX2 - DDLY2 (rh) */
    Ifx_UReg_32Bit reserved_11:1;     /**< \brief [11:11] \internal Reserved */
    Ifx_UReg_32Bit FDLY3:3;           /**< \brief [14:12] Frame Signal Delay Line RX3 - FDLY3 (rh) */
    Ifx_UReg_32Bit reserved_15:1;     /**< \brief [15:15] \internal Reserved */
    Ifx_UReg_32Bit CDLY3:3;           /**< \brief [18:16] Clock Signal Delay Line RX3 - CDLY3 (rh) */
    Ifx_UReg_32Bit reserved_19:1;     /**< \brief [19:19] \internal Reserved */
    Ifx_UReg_32Bit DDLY3:3;           /**< \brief [22:20] Data Signal Delay Line RX3 - DDLY3 (rh) */
    Ifx_UReg_32Bit reserved_23:1;     /**< \brief [23:23] \internal Reserved */
    Ifx_UReg_32Bit BMDLY0:3;          /**< \brief [26:24] Bist Mode Delay Line 0 - BMDLY0 (rh) */
    Ifx_UReg_32Bit reserved_27:1;     /**< \brief [27:27] \internal Reserved */
    Ifx_UReg_32Bit BMDLY1:3;          /**< \brief [30:28] Bist Mode Delay Line 1 - BMDLY1 (rh) */
    Ifx_UReg_32Bit reserved_31:1;     /**< \brief [31:31] \internal Reserved */
} Ifx_RIF_DBGDLY1_Bits;

/** \brief Data Formatting Unit Register */
typedef struct _Ifx_RIF_DFU_Bits
{
    Ifx_UReg_32Bit DF:1;              /**< \brief [0:0] Data Format - DF (rw) */
    Ifx_UReg_32Bit DA:1;              /**< \brief [1:1] Data Alignment - DA (rw) */
    Ifx_UReg_32Bit MSB:1;             /**< \brief [2:2] Shift Direction MSB / LSB First - MSB (rw) */
    Ifx_UReg_32Bit reserved_3:29;     /**< \brief [31:3] \internal Reserved */
} Ifx_RIF_DFU_Bits;

/** \brief Data Memory Interface Register */
typedef struct _Ifx_RIF_DMI_Bits
{
    Ifx_UReg_32Bit ENF0:1;            /**< \brief [0:0] Enable FIFO0 - ENF0 (rw) */
    Ifx_UReg_32Bit ENF1:1;            /**< \brief [1:1] Enable FIFO1 - ENF1 (rw) */
    Ifx_UReg_32Bit ENF2:1;            /**< \brief [2:2] Enable FIFO2 - ENF2 (rw) */
    Ifx_UReg_32Bit ENF3:1;            /**< \brief [3:3] Enable FIFO3 - ENF3 (rw) */
    Ifx_UReg_32Bit reserved_4:28;     /**< \brief [31:4] \internal Reserved */
} Ifx_RIF_DMI_Bits;

/** \brief External Serial Interface Register */
typedef struct _Ifx_RIF_ESI_Bits
{
    Ifx_UReg_32Bit CP:1;              /**< \brief [0:0] Clock Polarity - CP (rw) */
    Ifx_UReg_32Bit FP:1;              /**< \brief [1:1] Frame Polarity - FP (rw) */
    Ifx_UReg_32Bit DP0:1;             /**< \brief [2:2] Data Polarity for Lane 0 - DP0 (rw) */
    Ifx_UReg_32Bit DP1:1;             /**< \brief [3:3] Data Polarity for Lane 1 - DP1 (rw) */
    Ifx_UReg_32Bit DP2:1;             /**< \brief [4:4] Data Polarity for Lane 2 - DP2 (rw) */
    Ifx_UReg_32Bit DP3:1;             /**< \brief [5:5] Data Polarity for Lane 3 - DP3 (rw) */
    Ifx_UReg_32Bit reserved_6:10;     /**< \brief [15:6] \internal Reserved */
    Ifx_UReg_32Bit CALEN:1;           /**< \brief [16:16] Calibration Enable - CALEN (w) */
    Ifx_UReg_32Bit CALBSY:1;          /**< \brief [17:17] Calibration Busy - CALBSY (rh) */
    Ifx_UReg_32Bit CALSTAT:1;         /**< \brief [18:18] Calibration Status - CALSTAT (rh) */
    Ifx_UReg_32Bit reserved_19:13;    /**< \brief [31:19] \internal Reserved */
} Ifx_RIF_ESI_Bits;

/** \brief Flags Clear Register */
typedef struct _Ifx_RIF_FLAGSCL_Bits
{
    Ifx_UReg_32Bit reserved_0:16;     /**< \brief [15:0] \internal Reserved */
    Ifx_UReg_32Bit CALC:1;            /**< \brief [16:16] Calibration End Flag Clear - CALC (w) */
    Ifx_UReg_32Bit FWC:1;             /**< \brief [17:17] Frame Watchdog Flag Clear - FWC (w) */
    Ifx_UReg_32Bit REC:1;             /**< \brief [18:18] Ramp End Clear - REC (w) */
    Ifx_UReg_32Bit reserved_19:1;     /**< \brief [19:19] \internal Reserved */
    Ifx_UReg_32Bit CRCC0:1;           /**< \brief [20:20] CRC Error Flag Clear 0 - CRCC0 (w) */
    Ifx_UReg_32Bit CRCC1:1;           /**< \brief [21:21] CRC Error Flag Clear 1 - CRCC1 (w) */
    Ifx_UReg_32Bit CRCC2:1;           /**< \brief [22:22] CRC Error Flag Clear 2 - CRCC2 (w) */
    Ifx_UReg_32Bit CRCC3:1;           /**< \brief [23:23] CRC Error Flag Clear 3 - CRCC3 (w) */
    Ifx_UReg_32Bit R1EC:1;            /**< \brief [24:24] RAMP1 Error Flag Clear - R1EC (w) */
    Ifx_UReg_32Bit U1EC:1;            /**< \brief [25:25] Unimplemented Error Flag Clear - U1EC (w) */
    Ifx_UReg_32Bit R1SC:1;            /**< \brief [26:26] RAMP1 Start Flag Clear - R1SC (w) */
    Ifx_UReg_32Bit reserved_27:2;     /**< \brief [28:27] \internal Reserved */
    Ifx_UReg_32Bit SMCC:1;            /**< \brief [29:29] SMCF Alarm Flag Clear (w) */
    Ifx_UReg_32Bit REGCRCC:1;         /**< \brief [30:30] REGCRC Alarm Flag Clear (w) */
    Ifx_UReg_32Bit LOCKIC:1;          /**< \brief [31:31] RIF Internal Lockstep Alarm Flag Clear (w) */
} Ifx_RIF_FLAGSCL_Bits;

/** \brief Flags Set Register */
typedef struct _Ifx_RIF_FLAGSSET_Bits
{
    Ifx_UReg_32Bit reserved_0:16;     /**< \brief [15:0] \internal Reserved */
    Ifx_UReg_32Bit CALS:1;            /**< \brief [16:16] Calibration End Flag Set - CALS (w) */
    Ifx_UReg_32Bit FWS:1;             /**< \brief [17:17] Frame Watchdog Flag Set - FWS (w) */
    Ifx_UReg_32Bit RES:1;             /**< \brief [18:18] Ramp End Set - RES (w) */
    Ifx_UReg_32Bit UES:1;             /**< \brief [19:19] Unimplemented Event Set - CES (w) */
    Ifx_UReg_32Bit CRCS0:1;           /**< \brief [20:20] CRC Error Flag Set 0 - CRCS0 (w) */
    Ifx_UReg_32Bit CRCS1:1;           /**< \brief [21:21] CRC Error Flag Set 1 - CRCS1 (w) */
    Ifx_UReg_32Bit CRCS2:1;           /**< \brief [22:22] CRC Error Flag Set 2 - CRCS2 (w) */
    Ifx_UReg_32Bit CRCS3:1;           /**< \brief [23:23] CRC Error Flag Set 3 - CRCS3 (w) */
    Ifx_UReg_32Bit R1ES:1;            /**< \brief [24:24] RAMP1 Error Flag Set 3 - R1ES (w) */
    Ifx_UReg_32Bit U1ES:1;            /**< \brief [25:25] Unimplemented Error Flag Set - U1ES (w) */
    Ifx_UReg_32Bit R1SS:1;            /**< \brief [26:26] RAMP1 Start Set - R1SS (w) */
    Ifx_UReg_32Bit reserved_27:5;     /**< \brief [31:27] \internal Reserved */
} Ifx_RIF_FLAGSSET_Bits;

/** \brief FIFO and Lane Management Register */
typedef struct _Ifx_RIF_FLM_Bits
{
    Ifx_UReg_32Bit MODE:1;            /**< \brief [0:0] FLM Mode - MODE (rw) */
    Ifx_UReg_32Bit FSWP:1;            /**< \brief [1:1] Full Swap - FSWP (rw) */
    Ifx_UReg_32Bit reserved_2:6;      /**< \brief [7:2] \internal Reserved */
    Ifx_UReg_32Bit CRCEN:1;           /**< \brief [8:8] CRC Enable - CRCEN (rw) */
    Ifx_UReg_32Bit CRCALT:1;          /**< \brief [9:9] Alternative CRC (rw) */
    Ifx_UReg_32Bit CRCERIN:1;         /**< \brief [10:10] CRC Error Injection (rw) */
    Ifx_UReg_32Bit EXPCRCWO:1;        /**< \brief [11:11] Expected CRC Word Order (rw) */
    Ifx_UReg_32Bit CRCBS:1;           /**< \brief [12:12] CRC Byte Swap (rw) */
    Ifx_UReg_32Bit reserved_13:3;     /**< \brief [15:13] \internal Reserved */
    Ifx_UReg_32Bit REGCRCEN:2;        /**< \brief [17:16] Enable Bit for the Register CRC (rw) */
    Ifx_UReg_32Bit reserved_18:14;    /**< \brief [31:18] \internal Reserved */
} Ifx_RIF_FLM_Bits;

/** \brief Frame Watchdog Register */
typedef struct _Ifx_RIF_FWDG_Bits
{
    Ifx_UReg_32Bit THRESHOLD:10;      /**< \brief [9:0] Frame Watchdog Threshold - THRESHOLD (rw) */
    Ifx_UReg_32Bit reserved_10:22;    /**< \brief [31:10] \internal Reserved */
} Ifx_RIF_FWDG_Bits;

